In [2]:
# https://www.tutorialspoint.com/sqlite/sqlite_python.htm
import sqlite3 as sql3

# Create a Table

In [3]:
with sql3.connect('test.db') as conn:
    conn.execute("DROP TABLE IF EXISTS COMPANY")
    conn.execute('''
                 CREATE TABLE COMPANY
                 (ID INT PRIMARY KEY NOT NULL,
                  NAME TEXT NOT NULL, 
                  AGE INT NOT NULL,
                  ADDRESS CHAR(50), 
                  SALARY REAL);
                  ''')

# INSERT Operation

In [4]:
with sql3.connect('test.db') as conn:
    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)"
                 "VALUES (1, 'Paul', 32, 'California', 20000.00 )")

    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)"
                 "VALUES (2, 'Allen', 25, 'Texas', 15000.00 )")

    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)"
                 "VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )")

    conn.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY)"
                 "VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )")

# SELECT Operation

In [6]:
with sql3.connect('test.db') as conn:
    cur = conn.execute("SELECT id, name, address, salary from COMPANY")
    for row in cur:
       print("ID = ", row[0])
       print("NAME = ", row[1])
       print("ADDRESS = ", row[2])
       print("SALARY = ", row[3], "\n")

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  20000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

# UPDATE Operation

In [10]:
with sql3.connect('test.db') as conn:
    conn.execute("UPDATE COMPANY set SALARY = 25000.00 where ID = 1")
    conn.commit
    
    cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
    for row in cursor:
       print("ID = ", row[0])
       print("NAME = ", row[1])
       print("ADDRESS = ", row[2])
       print("SALARY = ", row[3], "\n")

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

# DELETE Operation

In [11]:
with sql3.connect('test.db') as conn:
    conn.execute("DELETE from COMPANY where ID = 2;")
    conn.commit()
    
    cursor = conn.execute("SELECT id, name, address, salary from COMPANY")
    for row in cursor:
       print("ID = ", row[0])
       print("NAME = ", row[1])
       print("ADDRESS = ", row[2])
       print("SALARY = ", row[3], "\n")

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0